In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
a = pd.Series([4,7,8,3,9], index = ['one', 'two', 'three', 'four', 'five'])

In [7]:
a

one      4
two      7
three    8
four     3
five     9
dtype: int64

In [8]:
a = pd.Series([4,7,8,3,9])

In [9]:
a

0    4
1    7
2    8
3    3
4    9
dtype: int64

In [10]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
a.values

array([4, 7, 8, 3, 9], dtype=int64)

In [12]:
a = pd.Series([4,7,8,3,9], index = ['one', 'two', 'three', 'four', 'five'])

In [13]:
a[2]

8

In [14]:
a['five']

9

In [15]:
a.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [20]:
df = pd.DataFrame({'Age': [46, 37, 44, 42, 42], 
                     'Country': ['Spain', 'Spain', 'Germany', 'Fermany', 'France'],
                     'Gender': ['Female', 'Female', 'Male', 'Male', 'Male']})

In [22]:
df['Age']

0    46
1    37
2    44
3    42
4    42
Name: Age, dtype: int64

In [23]:
df.Country

0      Spain
1      Spain
2    Germany
3    Fermany
4     France
Name: Country, dtype: object

In [24]:
df[['Country', 'Age']]

   Country  Age
0    Spain   46
1    Spain   37
2  Germany   44
3  Fermany   42
4   France   42

In [25]:
df

   Age  Country  Gender
0   46    Spain  Female
1   37    Spain  Female
2   44  Germany    Male
3   42  Fermany    Male
4   42   France    Male

In [26]:
df.columns

Index(['Age', 'Country', 'Gender'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
df = pd.DataFrame({'Age': [46, 37, 44, 42, 42], 
                     'Country': ['Spain', 'Spain', 'Germany', 'Fermany', 'France'],
                     'Gender': ['Female', 'Female', 'Male', 'Male', 'Male']}, index =[7, 6, 5, 4, 3])

In [29]:
df.index

Int64Index([7, 6, 5, 4, 3], dtype='int64')

In [30]:
df.index = [0, 1, 2, 3, 4]

In [31]:
df.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [34]:
df = pd.read_csv('./Churn_Modelling.csv')

In [35]:
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [36]:
df.head

<bound method NDFrame.head of       RowNumber  CustomerId    Surname  CreditScore Geography  Gender  Age  \
0             1    15634602   Hargrave          619    France  Female   42
1             2    15647311       Hill          608     Spain  Female   41
2             3    15619304       Onio          502    France  Female   42
3             4    15701354       Boni          699    France  Female   39
4             5    15737888   Mitchell          850     Spain  Female   43
...         ...         ...        ...          ...       ...     ...  ...
9995       9996    15606229   Obijiaku          771    France    Male   39
9996       9997    15569892  Johnstone          516    France    Male   35
9997       9998    15584532        Liu          709    France  Female   36
9998       9999    15682355  Sabbatini          772   Germany    Male   42
9999      10000    15628319     Walker          792    France  Female   28

      Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
0          2       0.00              1          1               1
1          1   83807.86              1          0               1
2          8  159660.80              3          1               0
3          1       0.00              2          0               0
4          2  125510.82              1          1               1
...      ...        ...            ...        ...             ...
9995       5       0.00              2          1               0
9996      10   57369.61              1          1               1
9997       7       0.00              1          0               1
9998       3   75075.31              2          1               0
9999       4  130142.79              1          1               0

      EstimatedSalary  Exited
0           101348.88       1
1           112542.58       0
2           113931.57       1
3            93826.63       0
4            79084.10       0
...               ...     ...
9995         96270.64       0
9996        101699.77       0
9997         42085.58       1
9998         92888.52       1
9999         38190.78       0

[10000 rows x 14 columns]>

In [37]:
df.tail

<bound method NDFrame.tail of       RowNumber  CustomerId    Surname  CreditScore Geography  Gender  Age  \
0             1    15634602   Hargrave          619    France  Female   42
1             2    15647311       Hill          608     Spain  Female   41
2             3    15619304       Onio          502    France  Female   42
3             4    15701354       Boni          699    France  Female   39
4             5    15737888   Mitchell          850     Spain  Female   43
...         ...         ...        ...          ...       ...     ...  ...
9995       9996    15606229   Obijiaku          771    France    Male   39
9996       9997    15569892  Johnstone          516    France    Male   35
9997       9998    15584532        Liu          709    France  Female   36
9998       9999    15682355  Sabbatini          772   Germany    Male   42
9999      10000    15628319     Walker          792    France  Female   28

      Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
0          2       0.00              1          1               1
1          1   83807.86              1          0               1
2          8  159660.80              3          1               0
3          1       0.00              2          0               0
4          2  125510.82              1          1               1
...      ...        ...            ...        ...             ...
9995       5       0.00              2          1               0
9996      10   57369.61              1          1               1
9997       7       0.00              1          0               1
9998       3   75075.31              2          1               0
9999       4  130142.79              1          1               0

      EstimatedSalary  Exited
0           101348.88       1
1           112542.58       0
2           113931.57       1
3            93826.63       0
4            79084.10       0
...               ...     ...
9995         96270.64       0
9996        101699.77       0
9997         42085.58       1
9998         92888.52       1
9999         38190.78       0

[10000 rows x 14 columns]>

In [38]:
df.tail(2)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [43]:
df.sample(frac = 0.5)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
5165,5166,15688612,Campos,850,France,Male,33,7,140956.99,1,0,0,3510.18,0
8127,8128,15623063,Taylor,651,Germany,Male,35,8,110067.71,1,1,0,127678.95,1
7911,7912,15809906,Mitchell,558,Germany,Male,26,1,148853.29,2,1,1,24411.02,0
2261,2262,15681402,Ngozichukwuka,763,Germany,Female,61,1,66101.89,1,1,1,143981.27,0
1340,1341,15645511,Chukwudi,727,Spain,Male,43,2,97403.18,1,1,1,107415.02,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3179,3180,15685536,Chu,552,France,Female,34,5,0.00,2,1,1,1351.41,0
4266,4267,15673984,Daniels,536,France,Female,35,8,0.00,1,1,0,171840.24,1
8439,8440,15692931,Hsing,670,France,Male,22,2,114991.45,1,1,1,37392.56,0
6133,6134,15620735,Chiganu,667,Germany,Female,33,4,127076.68,2,1,0,69011.66,0
2827,2828,15584190,Esposito,704,France,Male,36,7,120026.98,2,0,1,100601.73,0

In [46]:
df.shape

(10000, 14)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [48]:
df.describe()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00000,1.000000e+04,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,5000.50000,1.569094e+07,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,2886.89568,7.193619e+04,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.00000,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,2500.75000,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,5000.50000,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,7500.25000,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,10000.00000,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000